Config/Catalogs/НастройкиОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменаБанкиКС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыОбменаБанкиКС</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайловПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузкиПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьЗагрузкиПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьОтветСервисаВнешнейОбработкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьBOM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьБезопасностьОбменаЧерезКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/НастройкиОбменаБанкиКС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИсправитьАдресОбменаЕИС_2_0_107");
КонецПроцедуры

#КонецОбласти
                                    
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Владелец");
	МассивРеквизитов.Добавить("СпособОбмена");	
	МассивРеквизитов.Добавить("ПутьВыгрузкиПоУмолчанию");
	МассивРеквизитов.Добавить("ПутьЗагрузкиПоУмолчанию");	
	МассивРеквизитов.Добавить("ЗащищенноеСоединение");
	МассивРеквизитов.Добавить("ПассивноеСоединение");
	МассивРеквизитов.Добавить("Сервер");
	МассивРеквизитов.Добавить("ПутьНаСервере");
	МассивРеквизитов.Добавить("Порт");
	МассивРеквизитов.Добавить("Логин");
	МассивРеквизитов.Добавить("Пароль");
	МассивРеквизитов.Добавить("Таймаут");
	МассивРеквизитов.Добавить("ЗагружатьОтветСервисаВнешнейОбработкой");
	МассивРеквизитов.Добавить("ИспользоватьBOM");	
	МассивРеквизитов.Добавить("Описание");
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Владелец");
		
	Возврат Результат;
	
КонецФункции

Функция ИсправитьАдресОбменаЕИС_2_0_107() Экспорт
	
	СтарыйАдрес = "https://int44.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl";
	НовыйАдрес = "https://int.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl";	
	
	СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(НовыйАдрес);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОбменаБанкиКС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиОбменаБанкиКС КАК НастройкиОбменаБанкиКС
		|ГДЕ
		|	НастройкиОбменаБанкиКС.Владелец.ПредставлениеВНомереВерсии = ""UISP""
		|	И НастройкиОбменаБанкиКС.ПутьВыгрузкиПоУмолчанию = &ПутьВыгрузкиПоУмолчанию";
	
	Запрос.УстановитьПараметр("ПутьВыгрузкиПоУмолчанию", СтарыйАдрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекОбъект.ПутьВыгрузкиПоУмолчанию = НовыйАдрес;
		ТекОбъект.Сервер = СтруктураАдреса.Хост;//изменился только сервер, остальные настройки остались такие же
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекОбъект,Ложь);
	КонецЦикла;
		
КонецФункции

#КонецОбласти

#КонецЕсли
